burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_poc.c
/*!
    \brief      select output disable mode for TIMER7 (API_ID(0x000CU))
    \param[in]  ch0mch0_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch1mch1_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch2mch2_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch3mch3_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[out] none
    \retval     none
*/
void poc_timer7_output_disable_mode_select(uint8_t ch0mch0_pin_mode, uint8_t ch1mch1_pin_mode, uint8_t ch2mch2_pin_mode, uint8_t ch3mch3_pin_mode)
{
    POC_ODMODE0_TIMER7 = ((uint8_t)((uint8_t)((uint8_t)(ch0mch0_pin_mode & PIN_MODE_MASK) | (uint8_t)((ch1mch1_pin_mode & PIN_MODE_MASK) << 2U)) | \
                                    (uint8_t)((ch2mch2_pin_mode & PIN_MODE_MASK) << 4U)) | (uint8_t)((ch3mch3_pin_mode & PIN_MODE_MASK) << 6U));
}

/*!
    \brief      select output disable mode for TIMER1 (API_ID(0x000DU))
    \param[in]  ch0_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch1_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch2_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch3_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[out] none
    \retval     none
*/
void poc_timer1_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode, uint8_t ch2_pin_mode, uint8_t ch3_pin_mode)
{
    POC_ODMODE1_TIMER1 = ((uint8_t)((uint8_t)((uint8_t)(ch0_pin_mode & PIN_MODE_MASK) | (uint8_t)((ch1_pin_mode  & PIN_MODE_MASK) << 2U)) | \
                                    (uint8_t)((ch2_pin_mode & PIN_MODE_MASK) << 4U)) | (uint8_t)((ch3_pin_mode & PIN_MODE_MASK) << 6U));
}

/*!
    \brief      select output disable mode for TIMER2 (API_ID(0x000EU))
    \param[in]  ch0_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch1_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch2_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch3_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[out] none
    \retval     none
*/
void poc_timer2_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode, uint8_t ch2_pin_mode, uint8_t ch3_pin_mode)
{
    POC_ODMODE1_TIMER2 = ((uint8_t)((uint8_t)((uint8_t)(ch0_pin_mode & PIN_MODE_MASK) | (uint8_t)((ch1_pin_mode & PIN_MODE_MASK) << 2U)) | \
                                    (uint8_t)((ch2_pin_mode & PIN_MODE_MASK) << 4U)) | (uint8_t)((ch3_pin_mode & PIN_MODE_MASK) << 6U));
}

/*!
    \brief      select output disable mode for GPTIMER0 (API_ID(0x000FU))
    \param[in]  ch0_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch1_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[out] none
    \retval     none
*/
void poc_gptimer0_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode)
{
    POC_ODMODE1_GPTIMER0 = ((uint8_t)(ch0_pin_mode & PIN_MODE_MASK) | (uint8_t)((ch1_pin_mode & PIN_MODE_MASK) << 2U));
}

/*!
    \brief      select output disable mode for GPTIMER1 (API_ID(0x0010U))
    \param[in]  ch0_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[in]  ch1_pin_mode:
                only one parameter can be selected which are shown as below:
      \arg        POC_TIMER_CHANNEL_OUT: timer channel output
      \arg        POC_HIGH_IMPEDANCE_OUT: High-impedance output
      \arg        POC_GPIO_OUT: GPIO output
    \param[out] none
    \retval     none
*/
void poc_gptimer1_output_disable_mode_select(uint8_t ch0_pin_mode, uint8_t ch1_pin_mode)
{
    POC_ODMODE1_GPTIMER1 = ((uint8_t)(ch0_pin_mode & PIN_MODE_MASK) | (uint8_t)((ch1_pin_mode & PIN_MODE_MASK) << 2U));
}

/*!
    \brief      initialize POC request struct with a default value (API_ID(0x0011U))
    \param[in]  request: POC request struct parameter
    \param[out] none
    \retval     none
*/
void poc_request_struct_para_init(poc_request_struct *request)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(request)) {
        fw_debug_report_err(POC_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the POC request struct with the default value */
        request->req_pocin0 = TARGET_TIMER_NOT_SELECTED;
        request->req_pocin1 = TARGET_TIMER_NOT_SELECTED;
        request->req_pocin2 = TARGET_TIMER_NOT_SELECTED;
        request->req_pocin3 = TARGET_TIMER_NOT_SELECTED;
        request->req_pocin4 = TARGET_TIMER_NOT_SELECTED;
        request->req_pocin5 = TARGET_TIMER_NOT_SELECTED;
        request->req_comparator = TARGET_TIMER_NOT_SELECTED;
    }
}

/*!
    \brief      request select target timer (API_ID(0x0012U))
    \param[in]  request: poc request struct
      \arg        req_pocin0: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
      \arg        req_pocin1: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
      \arg        req_pocin2: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
      \arg        req_pocin3: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
      \arg        req_pocin4: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
      \arg        req_pocin5: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
      \arg        req_comparator: TARGET_TIMER_NOT_SELECTED, TARGET_TIMER_SELECTED
    \param[in]  target_timer: target timer
      \arg        TARGET_TIMER0: TIMER0
      \arg        TARGET_TIMER7: TIMER7
      \arg        TARGET_TIMER1: TIMER1
      \arg        TARGET_TIMER2: TIMER2
      \arg        TARGET_GPTIMER0: GPTIMER0
      \arg        TARGET_GPTIMER1: GPTIMER1
    \param[out] none
    \retval     none
*/
void poc_request_select(poc_request_struct *request, target_timer_enum target_timer)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(request)) {
        fw_debug_report_err(POC_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(target_timer) {
        case TARGET_TIMER0:
            POC_REQSEL0_TIMER0 = ((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(request->req_pocin0 & TIMER_SELECT_MASK) | (uint8_t)((request->req_pocin1 & TIMER_SELECT_MASK) << 1U)) | (uint8_t)((
                                                                              request->req_pocin2 & TIMER_SELECT_MASK) << 2U)) | (uint8_t)((request->req_pocin3 & TIMER_SELECT_MASK) << 3U)) | \
                                                      (uint8_t)((request->req_pocin4 & TIMER_SELECT_MASK) << 4U)) | (uint8_t)((request->req_pocin5 & TIMER_SELECT_MASK) << 5U)) | (uint8_t)((request->req_comparator & TIMER_SELECT_MASK) << 6U));
            break;
        case TARGET_TIMER7:
            POC_REQSEL0_TIMER7 = ((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(request->req_pocin0 & TIMER_SELECT_MASK) | (uint8_t)((request->req_pocin1 & TIMER_SELECT_MASK) << 1U)) | (uint8_t)((
                                                                              request->req_pocin2 & TIMER_SELECT_MASK) << 2U)) | (uint8_t)((request->req_pocin3 & TIMER_SELECT_MASK) << 3U)) | \
                                                      (uint8_t)((request->req_pocin4 & TIMER_SELECT_MASK) << 4U)) | (uint8_t)((request->req_pocin5 & TIMER_SELECT_MASK) << 5U)) | (uint8_t)((request->req_comparator & TIMER_SELECT_MASK) << 6U));
            break;
        case TARGET_TIMER1:
            POC_REQSEL1_TIMER1 = ((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(request->req_pocin0 & TIMER_SELECT_MASK) | (uint8_t)((request->req_pocin1 & TIMER_SELECT_MASK) << 1U)) | (uint8_t)((
                                                                              request->req_pocin2 & TIMER_SELECT_MASK) << 2U)) | (uint8_t)((request->req_pocin3 & TIMER_SELECT_MASK) << 3U)) | \
                                                      (uint8_t)((request->req_pocin4 & TIMER_SELECT_MASK) << 4U)) | (uint8_t)((request->req_pocin5 & TIMER_SELECT_MASK) << 5U)) | (uint8_t)((request->req_comparator & TIMER_SELECT_MASK) << 6U));
            break;
        case TARGET_TIMER2:
            POC_REQSEL1_TIMER2 = ((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(request->req_pocin0 & TIMER_SELECT_MASK) | (uint8_t)((request->req_pocin1 & TIMER_SELECT_MASK) << 1U)) | (uint8_t)((
                                                                              request->req_pocin2 & TIMER_SELECT_MASK) << 2U)) | (uint8_t)((request->req_pocin3 & TIMER_SELECT_MASK) << 3U)) | \
                                                      (uint8_t)((request->req_pocin4 & TIMER_SELECT_MASK) << 4U)) | (uint8_t)((request->req_pocin5 & TIMER_SELECT_MASK) << 5U)) | (uint8_t)((request->req_comparator & TIMER_SELECT_MASK) << 6U));
            break;
        case TARGET_GPTIMER0:
            POC_REQSEL1_GPTIMER0 = ((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(request->req_pocin0 & TIMER_SELECT_MASK) | (uint8_t)((request->req_pocin1 & TIMER_SELECT_MASK) << 1U)) |
                                                                            (uint8_t)((request->req_pocin2 & TIMER_SELECT_MASK) << 2U)) | (uint8_t)((request->req_pocin3 & TIMER_SELECT_MASK) << 3U)) | \
                                                        (uint8_t)((request->req_pocin4 & TIMER_SELECT_MASK) << 4U)) | (uint8_t)((request->req_pocin5 & TIMER_SELECT_MASK) << 5U)) | (uint8_t)((request->req_comparator & TIMER_SELECT_MASK) << 6U));
            break;
        case TARGET_GPTIMER1:
            POC_REQSEL1_GPTIMER1 = ((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)((uint8_t)(request->req_pocin0 & TIMER_SELECT_MASK) | (uint8_t)((request->req_pocin1 & TIMER_SELECT_MASK) << 1U)) |
                                                                            (uint8_t)((request->req_pocin2 & TIMER_SELECT_MASK) << 2U)) | (uint8_t)((request->req_pocin3 & TIMER_SELECT_MASK) << 3U)) | \
                                                        (uint8_t)((request->req_pocin4 & TIMER_SELECT_MASK) << 4U)) | (uint8_t)((request->req_pocin5 & TIMER_SELECT_MASK) << 5U)) | (uint8_t)((request->req_comparator & TIMER_SELECT_MASK) << 6U));
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure comparator disabling request status (API_ID(0x0013U))
    \param[in]  cmp0dreq_status: comparator 0 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP0_DREQ_DISABLE: comparator 0 disabling request disable
      \arg        CMP0_DREQ_ENABLE: comparator 0 disabling request enable
    \param[in]  cmp1dreq_status: comparator 1 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP1_DREQ_DISABLE: comparator 1 disabling request disable
      \arg        CMP1_DREQ_ENABLE: comparator 1 disabling request enable
    \param[in]  cmp2dreq_status: comparator 2 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP2_DREQ_DISABLE: comparator 2 disabling request disable
      \arg        CMP2_DREQ_ENABLE: comparator 2 disabling request enable
    \param[in]  cmp3dreq_status: comparator 3 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP3_DREQ_DISABLE: comparator 3 disabling request disable
      \arg        CMP3_DREQ_ENABLE: comparator 3 disabling request enable
    \param[out] none
    \retval     none
*/
void poc_cmp_dreq_status_config(uint32_t cmp0dreq_status, uint32_t cmp1dreq_status, uint32_t cmp2dreq_status, uint32_t cmp3dreq_status)
{
    POC_CTL1 = (uint32_t)((cmp0dreq_status & POC_CTL1_CMP0DREN) | (cmp1dreq_status & POC_CTL1_CMP1DREN) | (cmp2dreq_status & POC_CTL1_CMP2DREN) | (cmp3dreq_status & POC_CTL1_CMP3DREN));
}

/*!
    \brief      configure comparator disabling request status for target timer (API_ID(0x0014U))
    \param[in]  cmp0dreq_status: comparator 0 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP0_DREQ_DISABLE: comparator 0 disabling request disable
      \arg        CMP0_DREQ_ENABLE: comparator 0 disabling request enable
    \param[in]  cmp1dreq_status: comparator 1 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP1_DREQ_DISABLE: comparator 1 disabling request disable
      \arg        CMP1_DREQ_ENABLE: comparator 1 disabling request enable
    \param[in]  cmp2dreq_status: comparator 2 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP2_DREQ_DISABLE: comparator 2 disabling request disable
      \arg        CMP2_DREQ_ENABLE: comparator 2 disabling request enable
    \param[in]  cmp3dreq_status: comparator 3 disabling request status
                only one parameter can be selected which are shown as below:
      \arg        CMP3_DREQ_DISABLE: comparator 3 disabling request disable
      \arg        CMP3_DREQ_ENABLE: comparator 3 disabling request enable
    \param[in]  target_timer: TARGET_TIMERx(x=0~2,7), TARGET_GPTIMER0, TARGET_GPTIMER1
    \param[out] none
    \retval     none
*/
void poc_cmp_dreq_status_extended_config(uint32_t cmp0dreq_status, uint32_t cmp1dreq_status, uint32_t cmp2dreq_status, uint32_t cmp3dreq_status,
                                         target_timer_enum target_timer)
{
    switch(target_timer) {
    case TARGET_TIMER0:
        POC_EXTCTL0_TIMER0 = (uint8_t)((cmp0dreq_status & CMP0_DREQ_STATUS_MASK) | (cmp1dreq_status & CMP1_DREQ_STATUS_MASK) | (cmp2dreq_status & CMP2_DREQ_STATUS_MASK) |
                                       (cmp3dreq_status & CMP3_DREQ_STATUS_MASK));
        break;
    case TARGET_TIMER7:
        POC_EXTCTL0_TIMER7 = (uint8_t)((cmp0dreq_status & CMP0_DREQ_STATUS_MASK) | (cmp1dreq_status & CMP1_DREQ_STATUS_MASK) | (cmp2dreq_status & CMP2_DREQ_STATUS_MASK) |
                                       (cmp3dreq_status & CMP3_DREQ_STATUS_MASK));
        break;
    case TARGET_TIMER1:
        POC_EXTCTL1_TIMER1 = (uint8_t)((cmp0dreq_status & CMP0_DREQ_STATUS_MASK) | (cmp1dreq_status & CMP1_DREQ_STATUS_MASK) | (cmp2dreq_status & CMP2_DREQ_STATUS_MASK) |
                                       (cmp3dreq_status & CMP3_DREQ_STATUS_MASK));
        break;
    case TARGET_TIMER2:
        POC_EXTCTL1_TIMER2 = (uint8_t)((cmp0dreq_status & CMP0_DREQ_STATUS_MASK) | (cmp1dreq_status & CMP1_DREQ_STATUS_MASK) | (cmp2dreq_status & CMP2_DREQ_STATUS_MASK) |
                                       (cmp3dreq_status & CMP3_DREQ_STATUS_MASK));
        break;
    case TARGET_GPTIMER0:
        POC_EXTCTL1_GPTIMER0 = (uint8_t)((cmp0dreq_status & CMP0_DREQ_STATUS_MASK) | (cmp1dreq_status & CMP1_DREQ_STATUS_MASK) | (cmp2dreq_status & CMP2_DREQ_STATUS_MASK) |
                                         (cmp3dreq_status & CMP3_DREQ_STATUS_MASK));
        break;
    case TARGET_GPTIMER1:
        POC_EXTCTL1_GPTIMER1 = (uint8_t)((cmp0dreq_status & CMP0_DREQ_STATUS_MASK) | (cmp1dreq_status & CMP1_DREQ_STATUS_MASK) | (cmp2dreq_status & CMP2_DREQ_STATUS_MASK) |
                                         (cmp3dreq_status & CMP3_DREQ_STATUS_MASK));
        break;
    default:
        break;
    }
}

/*!
    \brief      mask POC_INn input detection (API_ID(0x0015U))
    \param[in]  poc_pin: POC_INn (n=0..5)
    \param[in]  mask_source: mask source selection
                only one parameter can be selected which are shown as below:
      \arg        POC_REQUEST_NOT_MASKED: detection is not masked
      \arg        POC_MASK_SOURCE_TIMER0_CH0: detection is masked by TIMER0_CH0
      \arg        POC_MASK_SOURCE_TIMER0_CH1: detection is masked by TIMER0_CH1
      \arg        POC_MASK_SOURCE_TIMER0_CH2: detection is masked by TIMER0_CH2
      \arg        POC_MASK_SOURCE_TIMER0_CH3: detection is masked by TIMER0_CH3
      \arg        POC_MASK_SOURCE_TIMER0_MCH0: detection is masked by TIMER0_MCH0
      \arg        POC_MASK_SOURCE_TIMER0_MCH1: detection is masked by TIMER0_MCH1
      \arg        POC_MASK_SOURCE_TIMER0_MCH2: detection is masked by TIMER0_MCH2
      \arg        POC_MASK_SOURCE_TIMER0_MCH3: detection is masked by TIMER0_MCH3
      \arg        POC_MASK_SOURCE_TIMER7_CH0: detection is masked by TIMER7_CH0
      \arg        POC_MASK_SOURCE_TIMER7_CH1: detection is masked by TIMER7_CH1
      \arg        POC_MASK_SOURCE_TIMER7_CH2: detection is masked by TIMER7_CH2
      \arg        POC_MASK_SOURCE_TIMER7_CH3: detection is masked by TIMER7_CH3
      \arg        POC_MASK_SOURCE_TIMER7_MCH0: detection is masked by TIMER7_MCH0
      \arg        POC_MASK_SOURCE_TIMER7_MCH1: detection is masked by TIMER7_MCH1
      \arg        POC_MASK_SOURCE_TIMER7_MCH2: detection is masked by TIMER7_MCH2
      \arg        POC_MASK_SOURCE_TIMER7_MCH3: detection is masked by TIMER7_MCH3
      \arg        POC_MASK_SOURCE_TIMER1_CH0: detection is masked by TIMER1_CH0
      \arg        POC_MASK_SOURCE_TIMER1_CH1: detection is masked by TIMER1_CH1
      \arg        POC_MASK_SOURCE_TIMER1_CH2: detection is masked by TIMER1_CH2
      \arg        POC_MASK_SOURCE_TIMER1_CH3: detection is masked by TIMER1_CH3
      \arg        POC_MASK_SOURCE_TIMER2_CH0: detection is masked by TIMER2_CH0
      \arg        POC_MASK_SOURCE_TIMER2_CH1: detection is masked by TIMER2_CH1
      \arg        POC_MASK_SOURCE_TIMER2_CH2: detection is masked by TIMER2_CH2
      \arg        POC_MASK_SOURCE_TIMER2_CH3: detection is masked by TIMER2_CH3
      \arg        POC_MASK_SOURCE_GPTIMER0_CH0: detection is masked by GPTIMER0_CH0
      \arg        POC_MASK_SOURCE_GPTIMER0_CH1: detection is masked by GPTIMER0_CH1
      \arg        POC_MASK_SOURCE_GPTIMER1_CH0: detection is masked by GPTIMER1_CH0
      \arg        POC_MASK_SOURCE_GPTIMER1_CH1: detection is masked by GPTIMER1_CH1
    \param[out] none
    \retval     none
*/
void poc_input_detection_mask(poc_pin_enum poc_pin, uint32_t mask_source)
{
    switch(poc_pin) {
    case POC_IN0:
        POC_IN0DMK = mask_source;
        break;
    case POC_IN1:
        POC_IN1DMK = mask_source;
        break;
    case POC_IN2:
        POC_IN2DMK = mask_source;
        break;
    case POC_IN3:
        POC_IN3DMK = mask_source;
        break;
    case POC_IN4:
        POC_IN4DMK = mask_source;
        break;
    case POC_IN5:
        POC_IN5DMK = mask_source;
        break;
    default:
        break;
    }
}

