burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_poc.c
/*!
    \brief      mask comparator output detection (API_ID(0x0016U))
    \param[in]  cmp_output: CMPx_OUT (n=0..3)
    \param[in]  mask_source: mask source selection
                only one parameter can be selected which are shown as below:
      \arg        POC_REQUEST_NOT_MASKED: detection is not masked
      \arg        POC_MASK_SOURCE_TIMER0_CH0: detection is masked by TIMER0_CH0
      \arg        POC_MASK_SOURCE_TIMER0_CH1: detection is masked by TIMER0_CH1
      \arg        POC_MASK_SOURCE_TIMER0_CH2: detection is masked by TIMER0_CH2
      \arg        POC_MASK_SOURCE_TIMER0_CH3: detection is masked by TIMER0_CH3
      \arg        POC_MASK_SOURCE_TIMER0_MCH0: detection is masked by TIMER0_MCH0
      \arg        POC_MASK_SOURCE_TIMER0_MCH1: detection is masked by TIMER0_MCH1
      \arg        POC_MASK_SOURCE_TIMER0_MCH2: detection is masked by TIMER0_MCH2
      \arg        POC_MASK_SOURCE_TIMER0_MCH3: detection is masked by TIMER0_MCH3
      \arg        POC_MASK_SOURCE_TIMER7_CH0: detection is masked by TIMER7_CH0
      \arg        POC_MASK_SOURCE_TIMER7_CH1: detection is masked by TIMER7_CH1
      \arg        POC_MASK_SOURCE_TIMER7_CH2: detection is masked by TIMER7_CH2
      \arg        POC_MASK_SOURCE_TIMER7_CH3: detection is masked by TIMER7_CH3
      \arg        POC_MASK_SOURCE_TIMER7_MCH0: detection is masked by TIMER7_MCH0
      \arg        POC_MASK_SOURCE_TIMER7_MCH1: detection is masked by TIMER7_MCH1
      \arg        POC_MASK_SOURCE_TIMER7_MCH2: detection is masked by TIMER7_MCH2
      \arg        POC_MASK_SOURCE_TIMER7_MCH3: detection is masked by TIMER7_MCH3
      \arg        POC_MASK_SOURCE_TIMER1_CH0: detection is masked by TIMER1_CH0
      \arg        POC_MASK_SOURCE_TIMER1_CH1: detection is masked by TIMER1_CH1
      \arg        POC_MASK_SOURCE_TIMER1_CH2: detection is masked by TIMER1_CH2
      \arg        POC_MASK_SOURCE_TIMER1_CH3: detection is masked by TIMER1_CH3
      \arg        POC_MASK_SOURCE_TIMER2_CH0: detection is masked by TIMER2_CH0
      \arg        POC_MASK_SOURCE_TIMER2_CH1: detection is masked by TIMER2_CH1
      \arg        POC_MASK_SOURCE_TIMER2_CH2: detection is masked by TIMER2_CH2
      \arg        POC_MASK_SOURCE_TIMER2_CH3: detection is masked by TIMER2_CH3
      \arg        POC_MASK_SOURCE_GPTIMER0_CH0: detection is masked by GPTIMER0_CH0
      \arg        POC_MASK_SOURCE_GPTIMER0_CH1: detection is masked by GPTIMER0_CH1
      \arg        POC_MASK_SOURCE_GPTIMER1_CH0: detection is masked by GPTIMER1_CH0
      \arg        POC_MASK_SOURCE_GPTIMER1_CH1: detection is masked by GPTIMER1_CH1
    \param[out] none
    \retval     none
*/
void poc_cmp_output_detection_mask(cmp_output_enum cmp_output, uint32_t mask_source)
{
    switch(cmp_output) {
    case CMP0_OUT:
        POC_CMP0DMK = mask_source;
        break;
    case CMP1_OUT:
        POC_CMP1DMK = mask_source;
        break;
    case CMP2_OUT:
        POC_CMP2DMK = mask_source;
        break;
    case CMP3_OUT:
        POC_CMP3DMK = mask_source;
        break;
    default:
        break;
    }
}

/*!
    \brief      get the POC flag (API_ID(0x0017U))
    \param[in]  flag: the POC flags, only one parameter can be selected which is shown
                as below:
      \arg        POC_FLAG_IN0IF: POC_IN0 input detection flag
      \arg        POC_FLAG_IN1IF: POC_IN1 input detection flag
      \arg        POC_FLAG_IN2IF: POC_IN2 input detection flag
      \arg        POC_FLAG_IN3IF: POC_IN3 input detection flag
      \arg        POC_FLAG_IN4IF: POC_IN4 input detection flag
      \arg        POC_FLAG_IN5IF: POC_IN5 input detection flag
      \arg        POC_FLAG_HXTALSDF: HXTAL stuck detection flag
      \arg        POC_FLAG_LOCKUPDF: CPU LOCKUP detection flag
      \arg        POC_FLAG_TIMER0_CCIF: TIMER0 concurrent conduction detection flag
      \arg        POC_FLAG_TIMER7_CCIF: TIMER7 concurrent conduction detection flag
      \arg        POC_FLAG_CMP0DF: comparator 0 detection flag
      \arg        POC_FLAG_CMP1DF: comparator 1 detection flag
      \arg        POC_FLAG_CMP2DF: comparator 2 detection flag
      \arg        POC_FLAG_CMP3DF: comparator 3 detection flag
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus poc_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;

    if(flag & POC_STAT_FLAG_MASK0) {
        /* check POC_STAT0 flag */
        if(RESET != (POC_STAT0 & flag)) {
            reval = SET;
        } else {
            reval = RESET;
        }
    } else if(flag & POC_STAT_FLAG_MASK1) {
        /* check POC_STAT1 flag */
        if(RESET != (POC_STAT1 & (flag >> 24U))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    } else {
        /* illegal parameters */
    }

    return reval;
}

/*!
    \brief      clear the POC flag (API_ID(0x0018U))
    \param[in]  flag: the POC flags, only one parameter can be selected which is shown
                as below:
      \arg        POC_FLAG_IN0IF: POC_IN0 input detection flag
      \arg        POC_FLAG_IN1IF: POC_IN1 input detection flag
      \arg        POC_FLAG_IN2IF: POC_IN2 input detection flag
      \arg        POC_FLAG_IN3IF: POC_IN3 input detection flag
      \arg        POC_FLAG_IN4IF: POC_IN4 input detection flag
      \arg        POC_FLAG_IN5IF: POC_IN5 input detection flag
      \arg        POC_FLAG_HXTALSDF: HXTAL stuck detection flag
      \arg        POC_FLAG_LOCKUPDF: CPU LOCKUP detection flag
      \arg        POC_FLAG_TIMER0_CCIF: TIMER0 concurrent conduction detection flag
      \arg        POC_FLAG_TIMER7_CCIF: TIMER7 concurrent conduction detection flag
      \arg        POC_FLAG_CMP0DF: comparator 0 detection flag
      \arg        POC_FLAG_CMP1DF: comparator 1 detection flag
      \arg        POC_FLAG_CMP2DF: comparator 2 detection flag
      \arg        POC_FLAG_CMP3DF: comparator 3 detection flag
    \param[out] none
    \retval     none
*/
void poc_flag_clear(uint32_t flag)
{
    if(flag & POC_STAT_FLAG_MASK0) {
        /* clear POC_STAT0 flag */
        POC_STAT0 = ~(uint32_t)(flag & POC_STAT_FLAG_MASK0);
    } else if(flag & POC_STAT_FLAG_MASK1) {
        /* clear POC_STAT1 flag */
        POC_STAT1 = ~(uint32_t)((flag & POC_STAT_FLAG_MASK1) >> 24U);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable POC interrupt (API_ID(0x0019U))
    \param[in]  interrupt:
                only one parameter can be selected which are shown as below:
      \arg        POC_INT_IN0: POC_IN0 input detection interrupt
      \arg        POC_INT_IN1: POC_IN1 input detection interrupt
      \arg        POC_INT_IN2: POC_IN2 input detection interrupt
      \arg        POC_INT_IN3: POC_IN3 input detection interrupt
      \arg        POC_INT_IN4: POC_IN4 input detection interrupt
      \arg        POC_INT_IN5: POC_IN5 input detection interrupt
      \arg        POC_INT_TIMER0CC: TIMER0 concurrent conduction detection interrupt
      \arg        POC_INT_TIMER7CC: TIMER7 concurrent conduction detection interrupt
    \param[out] none
    \retval     none
*/
void poc_interrupt_enable(poc_interrupt_enum interrupt)
{
    switch(interrupt) {
    /* enable POC_IN0 input detection interrupt */
    case POC_INT_IN0:
        POC_IN0DCFG_15_8 |= (uint8_t)(POC_INnDCFG_INIE >> 8U);
        break;
    /* enable POC_IN1 input detection interrupt */
    case POC_INT_IN1:
        POC_IN1DCFG_15_8 |= (uint8_t)(POC_INnDCFG_INIE >> 8U);
        break;
    /* enable POC_IN2 input detection interrupt */
    case POC_INT_IN2:
        POC_IN2DCFG_15_8 |= (uint8_t)(POC_INnDCFG_INIE >> 8U);
        break;
    /* enable POC_IN3 input detection interrupt */
    case POC_INT_IN3:
        POC_IN3DCFG_15_8 |= (uint8_t)(POC_INnDCFG_INIE >> 8U);
        break;
    /* enable POC_IN4 input detection interrupt */
    case POC_INT_IN4:
        POC_IN4DCFG_15_8 |= (uint8_t)(POC_INnDCFG_INIE >> 8U);
        break;
    /* enable POC_IN5 input detection interrupt */
    case POC_INT_IN5:
        POC_IN5DCFG_15_8 |= (uint8_t)(POC_INnDCFG_INIE >> 8U);
        break;
    /* enable TIMER0 concurrent conduction detection interrupt */
    case POC_INT_TIMER0CC:
        POC_CDCFG0 |= (uint32_t)POC_CDCFG0_TIMER0_CCIE;
        break;
    /* enable TIMER7 concurrent conduction detection interrupt */
    case POC_INT_TIMER7CC:
        POC_CDCFG1 |= (uint32_t)POC_CDCFG1_TIMER7_CCIE;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable POC interrupt (API_ID(0x001AU))
    \param[in]  interrupt:
                only one parameter can be selected which are shown as below:
      \arg        POC_INT_IN0: POC_IN0 input detection interrupt
      \arg        POC_INT_IN1: POC_IN1 input detection interrupt
      \arg        POC_INT_IN2: POC_IN2 input detection interrupt
      \arg        POC_INT_IN3: POC_IN3 input detection interrupt
      \arg        POC_INT_IN4: POC_IN4 input detection interrupt
      \arg        POC_INT_IN5: POC_IN5 input detection interrupt
      \arg        POC_INT_TIMER0CC: TIMER0 concurrent conduction detection interrupt
      \arg        POC_INT_TIMER7CC: TIMER7 concurrent conduction detection interrupt
    \param[out] none
    \retval     none
*/
void poc_interrupt_disable(poc_interrupt_enum interrupt)
{
    switch(interrupt) {
    /* enable POC_IN0 input detection interrupt */
    case POC_INT_IN0:
        POC_IN0DCFG_15_8 &= (uint8_t)(~(uint8_t)(POC_INnDCFG_INIE >> 8U));
        break;
    /* enable POC_IN1 input detection interrupt */
    case POC_INT_IN1:
        POC_IN1DCFG_15_8 &= (uint8_t)(~(uint8_t)(POC_INnDCFG_INIE >> 8U));
        break;
    /* enable POC_IN2 input detection interrupt */
    case POC_INT_IN2:
        POC_IN2DCFG_15_8 &= (uint8_t)(~(uint8_t)(POC_INnDCFG_INIE >> 8U));
        break;
    /* enable POC_IN3 input detection interrupt */
    case POC_INT_IN3:
        POC_IN3DCFG_15_8 &= (uint8_t)(~(uint8_t)(POC_INnDCFG_INIE >> 8U));
        break;
    /* enable POC_IN4 input detection interrupt */
    case POC_INT_IN4:
        POC_IN4DCFG_15_8 &= (uint8_t)(~(uint8_t)(POC_INnDCFG_INIE >> 8U));
        break;
    /* enable POC_IN5 input detection interrupt */
    case POC_INT_IN5:
        POC_IN5DCFG_15_8 &= (uint8_t)(~(uint8_t)(POC_INnDCFG_INIE >> 8U));
        break;
    /* enable TIMER0 concurrent conduction detection interrupt */
    case POC_INT_TIMER0CC:
        POC_CDCFG0 &= (uint32_t)(~(uint32_t)POC_CDCFG0_TIMER0_CCIE);
        break;
    /* enable TIMER7 concurrent conduction detection interrupt */
    case POC_INT_TIMER7CC:
        POC_CDCFG1 &= (uint32_t)(~(uint32_t)POC_CDCFG1_TIMER7_CCIE);
        break;
    default:
        break;
    }
}

/*!
    \brief      get POC interrupt flag (API_ID(0x001BU))
    \param[in]  int_flag: the POC flags, only one parameter can be selected which is shown
                as below:
      \arg        POC_INT_FLAG_IN0IF: POC_IN0 input interrupt flag
      \arg        POC_INT_FLAG_IN1IF: POC_IN1 input interrupt flag
      \arg        POC_INT_FLAG_IN2IF: POC_IN2 input interrupt flag
      \arg        POC_INT_FLAG_IN3IF: POC_IN3 input interrupt flag
      \arg        POC_INT_FLAG_IN4IF: POC_IN4 input interrupt flag
      \arg        POC_INT_FLAG_IN5IF: POC_IN5 input interrupt flag
      \arg        POC_INT_FLAG_TIMER0_CCIF: TIMER0 concurrent conduction interrupt flag
      \arg        POC_INT_FLAG_TIMER7_CCIF: TIMER7 concurrent conduction interrupt flag
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus poc_interrupt_flag_get(uint32_t int_flag)
{
    uint32_t intstatus = 0U, flagstatus = 0U;
    FlagStatus retval = RESET;

    switch(int_flag) {
    case POC_INT_FLAG_IN0IF:
        /* check POC_INT_FLAG_IN0IF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_IN0IF;
        intstatus = POC_IN0DCFG & POC_INnDCFG_INIE;
        break;
    case POC_INT_FLAG_IN1IF:
        /* check POC_INT_FLAG_IN1IF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_IN1IF;
        intstatus = POC_IN1DCFG & POC_INnDCFG_INIE;
        break;
    case POC_INT_FLAG_IN2IF:
        /* check POC_INT_FLAG_IN2IF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_IN2IF;
        intstatus = POC_IN2DCFG & POC_INnDCFG_INIE;
        break;
    case POC_INT_FLAG_IN3IF:
        /* check POC_INT_FLAG_IN3IF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_IN3IF;
        intstatus = POC_IN3DCFG & POC_INnDCFG_INIE;
        break;
    case POC_INT_FLAG_IN4IF:
        /* check POC_INT_FLAG_IN4IF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_IN4IF;
        intstatus = POC_IN4DCFG & POC_INnDCFG_INIE;
        break;
    case POC_INT_FLAG_IN5IF:
        /* check POC_INT_FLAG_IN5IF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_IN5IF;
        intstatus = POC_IN5DCFG & POC_INnDCFG_INIE;
        break;
    case POC_INT_FLAG_TIMER0_CCIF:
        /* check POC_INT_FLAG_TIMER0_CCIF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_TIMER0_CCIF;
        intstatus = POC_CDCFG0 & POC_CDCFG0_TIMER0_CCIE;
        break;
    case POC_INT_FLAG_TIMER7_CCIF:
        /* check POC_INT_FLAG_TIMER7_CCIF flag */
        flagstatus = POC_STAT0 & POC_INT_FLAG_TIMER7_CCIF;
        intstatus = POC_CDCFG1 & POC_CDCFG1_TIMER7_CCIE;
        break;
    default:
        break;
    }

    if((0U != flagstatus) && (0U != intstatus)) {
        retval = SET;
    } else {
        retval = RESET;
    }

    return retval;
}

/*!
    \brief      clear POC interrupt flag (API_ID(0x001CU))
    \param[in]  int_flag: the POC flags, one or more parameters can be selected which is shown
                as below:
      \arg        POC_INT_FLAG_IN0IF: POC_IN0 input interrupt flag
      \arg        POC_INT_FLAG_IN1IF: POC_IN1 input interrupt flag
      \arg        POC_INT_FLAG_IN2IF: POC_IN2 input interrupt flag
      \arg        POC_INT_FLAG_IN3IF: POC_IN3 input interrupt flag
      \arg        POC_INT_FLAG_IN4IF: POC_IN4 input interrupt flag
      \arg        POC_INT_FLAG_IN5IF: POC_IN5 input interrupt flag
      \arg        POC_INT_FLAG_TIMER0_CCIF: TIMER0 concurrent conduction interrupt flag
      \arg        POC_INT_FLAG_TIMER7_CCIF: TIMER7 concurrent conduction interrupt flag
    \param[out] none
    \retval     SET or RESET
*/
void poc_interrupt_flag_clear(uint32_t int_flag)
{
    if(int_flag & POC_INT_FLAG_MASK) {
        /* clear interrupt flag */
        POC_STAT0 = ~(uint32_t)(int_flag & POC_INT_FLAG_MASK);
    } else {
        /* illegal parameters */
    }
}
